ERP.belugaerp/src/Reports/бг_СоответствиеРасходаМатериаловВПроизводствеНормативам/бг_СоответствиеРасходаМатериаловВПроизводствеНормативам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>бг_СоответствиеРасходаМатериаловВПроизводствеНормативам</name>
</mdclass:Report>

ERP.belugaerp/src/Documents/ЭтапПроизводства2_2/ЭтапПроизводства2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЭтапПроизводства2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностямВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностям</registerRecords>
  <registerRecords>InformationRegister.бг_ДвижениеМарок</registerRecords>
  <attributes>
    <name>бг_ДатаОтгрузкиВремя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_СтранаНазначения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантПриемкиТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НазначениеМатериалы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПартияПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РасходОднойДатой</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Этап</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>бг_ПроизводственнаяЛиния</name>
      <type>
        <types>CatalogRef.бг_ПроизводственныеЛинии</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Произведено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаПроизводства</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасходМатериаловИРабот</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбеспечениеМатериаламиИРаботами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>бг_ДополнительныйРасход</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Обособленно</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_АкцизПоПриобретеннымЦенностямМатериалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>CatalogRef.бг_БанковскиеГарантии</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСырья</name>
      <type>
        <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАкциза</name>
      <type>
        <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПродукции</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОплатыАванса</name>
      <type>
        <types>CatalogRef.бг_СостоянияОплатыАванса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_АкцизПоПриобретеннымЦенностямПродукция</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>CatalogRef.бг_БанковскиеГарантии</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСырья</name>
      <type>
        <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАкциза</name>
      <type>
        <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПродукции</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОплатыАванса</name>
      <type>
        <types>CatalogRef.бг_СостоянияОплатыАванса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Reports/бг_СоответствиеРасходаМатериаловВПроизводствеНормативам/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПриСозданииНаСервере = Истина;
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   ЭтаФорма             - ФормаКлиентскогоПриложения - Форма отчета.
//   Отказ                - Булево - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Булево - Передается из параметров обработчика "как есть".
//
// См. также:
//   "ФормаКлиентскогоПриложения.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	КомпоновщикНастроекФормы = ЭтаФорма.Отчет.КомпоновщикНастроек;
	Параметры = ЭтаФорма.Параметры;
	
	Если Параметры.Свойство("ПараметрКоманды")
		И ТипЗнч(Параметры.ПараметрКоманды) = Тип("ДокументСсылка.ЭтапПроизводства2_2") Тогда
		ЭтаФорма.ФормаПараметры.Отбор.Вставить("ЭтапПроизводства", Параметры.ПараметрКоманды);
		ЭтаФорма.ФормаПараметры.КлючНазначенияИспользования = "ПоДокументу";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ЭтапыПроизводства = ЭтапыПроизводства(Настройки);
	Если ЭтапыПроизводства.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не задан этап производства.'");
	КонецЕсли;
	
	РасходМатериалов = РасходМатериалов(ЭтапыПроизводства);
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ВнешнийНаборДанных = Новый Структура("РасходМатериалов", РасходМатериалов);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭтапыПроизводства(Настройки)
	ЭтапыПроизводства = Новый Массив;
	
	ПараметрЭтапыПроизводства = Настройки.ПараметрыДанных.Элементы.Найти("ЭтапПроизводства");
	ПараметрДатаПроизводства  = Настройки.ПараметрыДанных.Элементы.Найти("ДатаПроизводства");
	
	Если ПараметрЭтапыПроизводства <> Неопределено
		И ПараметрЭтапыПроизводства.Использование Тогда
		
		Если ТипЗнч(ПараметрЭтапыПроизводства.Значение) = Тип("СписокЗначений") Тогда
			ЭтапыПроизводства = ПараметрЭтапыПроизводства.Значение.ВыгрузитьЗначения();
		ИначеЕсли ЗначениеЗаполнено(ПараметрЭтапыПроизводства.Значение) Тогда
			ЭтапыПроизводства.Добавить(ПараметрЭтапыПроизводства.Значение);
		КонецЕсли;
		
	ИначеЕсли ПараметрДатаПроизводства <> Неопределено
		И ПараметрДатаПроизводства.Использование Тогда
		ЭтапыПроизводства = бг_ЭтапПроизводства2_2.ЭтапыПроизводстваПоДатеВыпуска(
										ПараметрДатаПроизводства.Значение.ДатаНачала,
										ПараметрДатаПроизводства.Значение.ДатаОкончания);
	КонецЕсли;
	
	Возврат ЭтапыПроизводства;
КонецФункции

Функция РасходМатериалов(ЭтапыПроизводства)
	ТаблицаРасходМатериалов = Новый ТаблицаЗначений;
	ТаблицаРасходМатериалов.Колонки.Добавить("ЭтапПроизводства", Новый ОписаниеТипов("ДокументСсылка.ЭтапПроизводства2_2"));
	ТаблицаРасходМатериалов.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.РесурсныеСпецификации"));
	ТаблицаРасходМатериалов.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаРасходМатериалов.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаРасходМатериалов.Колонки.Добавить("КоличествоОбеспечение", Новый ОписаниеТипов("Число"));
	ТаблицаРасходМатериалов.Колонки.Добавить("КоличествоПотребность", Новый ОписаниеТипов("Число"));
	ТаблицаРасходМатериалов.Колонки.Добавить("КоличествоРасхождение", Новый ОписаниеТипов("Число"));
	
	Для Каждого ЭтапПроизводства Из ЭтапыПроизводства Цикл
		ДанныеЭтапаПроизводства = ДанныеЭтапаПроизводства(ЭтапПроизводства);
		Если ДанныеЭтапаПроизводства = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПотребностьСогласноСпецификации          = бг_ЭтапПроизводства2_2.ПотребностьСогласноСпецификации(ДанныеЭтапаПроизводства);
		СоотношениеРасходаМатериаловСНормативами = бг_ЭтапПроизводства2_2.СоотношениеРасходаМатериаловСНормативами(ДанныеЭтапаПроизводства,
																					ПотребностьСогласноСпецификации, Ложь, Ложь);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СоотношениеРасходаМатериаловСНормативами, ТаблицаРасходМатериалов);
	КонецЦикла;
	
	ДополнитьРасходНеИзрасходованнымиМатериалами(ТаблицаРасходМатериалов, ЭтапыПроизводства);
	
	Возврат ТаблицаРасходМатериалов;
КонецФункции

Функция ДанныеЭтапаПроизводства(ЭтапПроизводства)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЭтапПроизводства.Ссылка КАК Ссылка,
	|	ЭтапПроизводства.Спецификация КАК Спецификация
	|ИЗ
	|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства
	|ГДЕ
	|	ЭтапПроизводства.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыходныеИзделия.Номенклатура КАК Номенклатура,
	|	ВыходныеИзделия.Характеристика КАК Характеристика,
	|	СУММА(ВыходныеИзделия.Количество) КАК Количество
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ВыходныеИзделия
	|ГДЕ
	|	ВыходныеИзделия.Ссылка = &Ссылка
	|	И НЕ ВыходныеИзделия.Отменено
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыходныеИзделия.Номенклатура,
	|	ВыходныеИзделия.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбеспечениеМатериаламиИРаботами.Ссылка КАК Ссылка,
	|	ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
	|	ОбеспечениеМатериаламиИРаботами.Характеристика КАК Характеристика,
	|	ОбеспечениеМатериаламиИРаботами.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ОбеспечениеМатериаламиИРаботами.Склад КАК Склад,
	|	ОбеспечениеМатериаламиИРаботами.Назначение КАК Назначение,
	|	ОбеспечениеМатериаламиИРаботами.Отменено КАК Отменено,
	|	ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения КАК ВариантОбеспечения,
	|	ОбеспечениеМатериаламиИРаботами.КоличествоУпаковок КАК КоличествоУпаковок
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ОбеспечениеМатериаламиИРаботами
	|ГДЕ
	|	ОбеспечениеМатериаламиИРаботами.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ЭтапПроизводства);
	Результат = Запрос.ВыполнитьПакет();
	
	РезультатШапкаДокумента  = Результат[0];
	РезультатВыходныеИзделия = Результат[1];
	РезультатОбеспечение     = Результат[2];
	
	Если РезультатШапкаДокумента.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеЭтапаПроизводства = Новый Структура("Ссылка, Спецификация");
	ВыборкаШапка = РезультатШапкаДокумента.Выбрать();
	Если ВыборкаШапка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеЭтапаПроизводства, ВыборкаШапка);
	КонецЕсли;
	
	ДанныеЭтапаПроизводства.Вставить("ВыходныеИзделия", РезультатВыходныеИзделия.Выгрузить());
	ДанныеЭтапаПроизводства.Вставить("ОбеспечениеМатериаламиИРаботами", РезультатОбеспечение.Выгрузить());
	
	Возврат ДанныеЭтапаПроизводства;
КонецФункции

Процедура ДополнитьРасходНеИзрасходованнымиМатериалами(ТаблицаРасходМатериалов, ЭтапыПроизводства)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЭкономияМатериалов.Ссылка КАК ЭтапПроизводства,
	|	ЭкономияМатериалов.Ссылка.Спецификация КАК Спецификация,
	|	ЭкономияМатериалов.Номенклатура КАК Номенклатура,
	|	ЭкономияМатериалов.Характеристика КАК Характеристика,
	|	- ЭкономияМатериалов.Количество КАК КоличествоОбеспечение,
	|	- ЭкономияМатериалов.Количество КАК КоличествоРасхождение
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ЭкономияМатериалов КАК ЭкономияМатериалов
	|ГДЕ
	|	ЭкономияМатериалов.Ссылка В(&Ссылка)";
	Запрос.УстановитьПараметр("Ссылка", ЭтапыПроизводства);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРасходМатериалов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
